"""
https://informatics.msk.ru/mod/statements/view.php?id=3863&chapterid=3736#1
    Задача №3736. Количество слов
входные данные: Hello world
выходные данные: 2
"""

s = input()
num = s.count(' ') + 1
print(num)

