"""
                        < 5 > Search in Lists
"""

#                   (1.1) List.index(Value)
#  根据数据值, 查找元素所在的下标, 返回找到元素的下标, 没有找到会报错. 列表没有find方法
#  语法: list.index(数据, 开始位置, 结束位置)

my_list = [1, 3.14, 'issac', False]

id = my_list.index(3.14)
print(id)  # 1

# ----------------------------------------------------------------------------------------------------------------
#                   (1.2) List.index(value, start, stop) : 可以在一个区间内进行查找
l = ['hello', 'world', '98', 'hello']
print(l.index('hello', 1, 4))  # 3

# -------------------------------------------------------------------------------------------------------------------
#                   (2)  List.count() : 统计出现的次数
num = my_list.count(1)
print(num) # 1
# ------------------------------------------------------------------------------------------------------------------

#                   (3) in / not in : 判断是否存在，, 存在是True, 不存在是False. 一般和 if else 结合使用
num2 = 3.14 in my_list # True
num3 = 3.14 not in my_list # False

# ----------------------------------------------------------------------------------------------------------------

